{
  "week1": {
    "title": "God's Love for You",
    "days": [
      {
        "day": 1,
        "verse": "For God so loved the world that he gave his one and only Son, that whoever believes in him shall not perish but have eternal life.",
        "verseReference": "John 3:16",
        "devotional": "God's love is not distant or abstract—it is personal. The Father gave His only Son for you. Addiction whispers that you are worthless, but the cross shouts that you are priceless. Every time you are tempted to believe shame, remember: Christ thought you were worth dying for.",
        "reflection": "God loves you even in your weakness. What does it mean to you that He gave His Son for you?",
        "activity": "Write down 3 ways you have experienced God's love in your life (big or small).",
        "prayer": "Pray for someone you know who feels unloved or unworthy, that they may see God's love."
      },
      {
        "day": 2,
        "verse": "But God demonstrates his own love for us in this: While we were still sinners, Christ died for us.",
        "verseReference": "Romans 5:8",
        "devotional": "You don't need to clean yourself up before coming to Christ. He loved you at your worst. Porn says, 'You are too dirty to be loved.' But God says, 'I loved you when you were dead in sin, and I died to bring you life.' Repentance doesn't start with your effort—it starts with God's love reaching for you in the pit.",
        "reflection": "Christ died for you at your lowest point. How does this change the way you see relapse?",
        "activity": "Journal one lie that porn has made you believe about yourself and replace it with God's truth from this verse.",
        "prayer": "Intercede for another struggler today—that they may believe they are loved even in weakness."
      },
      {
        "day": 3,
        "verse": "The eyes of all look to you, and you give them their food at the proper time. You open your hand and satisfy the desires of every living thing.",
        "verseReference": "Psalm 145:15-16",
        "devotional": "Many turn to lust when they feel empty, lonely, or restless. But God promises to open His hand and satisfy every need. The hunger for intimacy, comfort, and love that porn pretends to fill can only be truly satisfied by the living God. When you feel the urge rising, see it as a reminder to turn to Him instead of the counterfeit.",
        "reflection": "Where do you feel emptiest right now? How might God fill that place with something better than lust?",
        "activity": "When tempted today, pause and pray this Psalm aloud. Write down how it changed the moment.",
        "prayer": "Pray for those who will be tempted tonight, that God would be their strength."
      },
      {
        "day": 4,
        "verse": "See what great love the Father has lavished on us, that we should be called children of God! And that is what we are!",
        "verseReference": "1 John 3:1",
        "devotional": "Shame says: 'You are dirty, you are worthless.' God says: 'You are My child.' Your failures don't erase His fatherhood. Porn tries to steal your identity by defining you by your lust. But the truth is, your truest name is 'Beloved Child of God.' The more you believe this, the weaker lust's hold becomes.",
        "reflection": "What would it change if your deepest identity was truly 'Child of God' and not 'addict'?",
        "activity": "Write a letter to yourself as if God the Father were speaking to you. Begin with: 'My child, I love you…'.",
        "prayer": "Pray for someone younger than you who may already be trapped in lust, that they find their identity in Christ."
      },
      {
        "day": 5,
        "verse": "I have loved you with an everlasting love; I have drawn you with unfailing kindness.",
        "verseReference": "Jeremiah 31:3",
        "devotional": "God's love is everlasting. He does not stop loving you when you fall. You may hate yourself after relapse, but His love has not decreased. His kindness draws you back, not His anger. If you fall, don't hide—return to the God whose love outlasts your failures.",
        "reflection": "Think of your last relapse. How does it feel to know God's love did not end at that moment?",
        "activity": "Bring your most recent fall to God in prayer. Journal how it feels to know He still loves you.",
        "prayer": "Pray for someone who has recently fallen, that they may not give up but run back to God."
      },
      {
        "day": 6,
        "verse": "Can a mother forget the baby at her breast and have no compassion on the child she has borne? Though she may forget, I will not forget you! See, I have engraved you on the palms of my hands.",
        "verseReference": "Isaiah 49:15-16",
        "devotional": "God uses a mother's love to illustrate His own—and then says His is stronger. Even if a mother could forget her baby, He cannot forget you. Porn tells you that you are alone and unseen, but God says your name is engraved on His hands. When you see the scars on Christ's hands, remember: they testify that He cannot forget you.",
        "reflection": "What does it mean to you that your name is engraved on God's hands?",
        "activity": "Draw or write your name on your palm today as a reminder of God's promise. Reflect whenever you see it.",
        "prayer": "Intercede for someone who feels forgotten by God, that they may know they are engraved on His hands."
      },
      {
        "day": 7,
        "verse": "For I am convinced that neither death nor life, neither angels nor demons, neither the present nor the future, nor any powers, neither height nor depth, nor anything else in all creation, will be able to separate us from the love of God that is in Christ Jesus our Lord.",
        "verseReference": "Romans 8:38-39",
        "devotional": "This is the mountain peak of God's love. Nothing can separate you from Him—not relapse, not shame, not lust. Satan wants you to believe that you are beyond saving, but this verse demolishes that lie. You can fall into sin, but you cannot fall out of God's love. That truth gives you courage to rise again.",
        "reflection": "Which part of this verse speaks to you most right now? Why?",
        "activity": "Make a gratitude list of 10 things you are thankful for this week. End by writing: 'Nothing can separate me from God's love.'",
        "prayer": "Pray for the Novo community as a whole—that each struggler may believe in God's inseparable love."
      }
    ]
  },
  "week2": {
    "title": "The Sinner's Need of Christ",
    "days": [
      {
        "day": 1,
        "verse": "For all have sinned and fall short of the glory of God.",
        "verseReference": "Romans 3:23",
        "devotional": "Every person has sinned; no one is exempt. Porn addiction is just one expression of this universal brokenness. The good news is that your failure does not make you uniquely unworthy—it simply proves your need of Jesus, just like everyone else. Freedom begins when you admit that you cannot meet God's standard on your own.",
        "reflection": "How does knowing that 'all have sinned' free you from isolating shame?",
        "activity": "Write down areas of your life (not just porn) where you see evidence of sin and your need for God.",
        "prayer": "Pray for someone else you know who struggles in a visible way—that they may also see their need for Christ."
      },
      {
        "day": 2,
        "verse": "We have all become like one who is unclean, and all our righteous deeds are like a polluted garment. We all fade like a leaf, and our iniquities, like the wind, take us away.",
        "verseReference": "Isaiah 64:6",
        "devotional": "Even your best efforts cannot make you clean before God. This verse reminds us that trying harder, by itself, won't break porn's chains. Addiction teaches us to rely on willpower, but God teaches us to rely on grace. When you bring your unclean life to Him, He gives you His righteousness in exchange.",
        "reflection": "What 'self-righteous' efforts have you been relying on to fight sin? How can you bring them to God instead?",
        "activity": "Write a prayer of surrender, confessing your weakness and asking God to clothe you in Christ's righteousness.",
        "prayer": "Pray for someone who is trying to fight sin by sheer willpower, that they may discover God's grace."
      },
      {
        "day": 3,
        "verse": "The heart is deceitful above all things, and desperately sick; who can understand it?",
        "verseReference": "Jeremiah 17:9",
        "devotional": "Porn doesn't just live on screens—it thrives in a deceitful heart. We often minimize sin, excuse it, or hide it. But God sees our hearts clearly. The good news is that He not only exposes the sickness but also promises to give us a new heart. Honesty before God is the first step toward healing.",
        "reflection": "In what ways has your heart deceived you in your struggle with lust?",
        "activity": "Spend 5 minutes in silent prayer, asking God to reveal hidden motives and desires. Write down what comes to mind.",
        "prayer": "Pray for someone who is deceived by sin but does not see it yet, that God may open their eyes."
      },
      {
        "day": 4,
        "verse": "For I know that nothing good dwells in me, that is, in my flesh. For I have the desire to do what is right, but not the ability to carry it out.",
        "verseReference": "Romans 7:18",
        "devotional": "This verse captures the addict's cry: 'I want to stop, but I can't.' Even Paul felt this war in his flesh. Recognizing that you don't have the ability to carry out your desires is not defeat—it's the doorway to dependence on Christ. Your weakness creates the space for His power.",
        "reflection": "How does admitting your inability to change on your own make room for God's strength?",
        "activity": "Journal a time when you sincerely wanted to quit but fell anyway. Then write: 'Lord, I cannot, but You can.'",
        "prayer": "Pray for someone in recovery who feels hopeless because of repeated failure."
      },
      {
        "day": 5,
        "verse": "I am the vine; you are the branches. Whoever abides in me and I in him, he it is that bears much fruit, for apart from me you can do nothing.",
        "verseReference": "John 15:5",
        "devotional": "Victory is not found in trying harder but in abiding deeper. A branch disconnected from the vine cannot bear fruit. In the same way, you cannot bear purity apart from Christ. The call is simple: remain in Him daily. The more connected you are to Him, the more His life flows into you.",
        "reflection": "What does it mean to you, practically, to 'abide' in Christ this week?",
        "activity": "Spend 10 minutes reading John 15:1–11 slowly. Write down 3 ways you can stay connected to Christ today.",
        "prayer": "Pray for another struggler to experience the life of Christ flowing into their weakest places."
      },
      {
        "day": 6,
        "verse": "For the wages of sin is death, but the free gift of God is eternal life in Christ Jesus our Lord.",
        "verseReference": "Romans 6:23",
        "devotional": "Sin always pays its wage: death. Porn kills intimacy, kills joy, kills hope. But God offers a better gift—eternal life in Christ. You don't have to stay stuck in the paycheck of death. Eternal life begins now, in freedom through Jesus.",
        "reflection": "How have you experienced 'death' in your life as a result of lust? How does this verse offer you hope?",
        "activity": "List 3 ways porn has 'paid death' in your life, then next to each one write what God promises instead in Christ.",
        "prayer": "Pray for someone who is still enslaved to porn, that they may discover the gift of life in Jesus."
      },
      {
        "day": 7,
        "verse": "For if, because of one man's trespass, death reigned through that one man, much more will those who receive the abundance of grace and the free gift of righteousness reign in life through the one man Jesus Christ.",
        "verseReference": "Romans 5:17",
        "devotional": "Adam's fall brought death, but Christ's gift brings life and victory. Grace is not just forgiveness—it is power to reign in life. Addiction makes you feel powerless, but Christ gives you authority to stand. The reign of sin can be broken by the reign of grace.",
        "reflection": "Where in your life do you feel 'reigned over' by sin? How could grace reign there instead?",
        "activity": "Write down one area of life where you feel powerless. Pray specifically for God's grace to reign in that area this week.",
        "prayer": "Pray for the Novo community—that God's grace would reign over every place of bondage."
      }
    ]
  },
  "week3": {
    "title": "Repentance",
    "days": [
      {
        "day": 15,
        "verse": "I will give you a new heart and put a new spirit in you; I will remove from you your heart of stone and give you a heart of flesh.",
        "verseReference": "Ezekiel 36:26",
        "devotional": "Real repentance isn't something you manufacture through guilt. It's something God gives you as a gift. Many try to quit porn and masturbation by sheer willpower, but only God can replace a heart hardened by lust with one tender to His presence. Don't focus on fixing yourself—ask for a new heart. Every time you feel powerless, whisper this verse as a prayer: 'Lord, give me a new heart.'",
        "reflection": "Where have you felt your heart grow numb to God's voice? What would it mean for Him to give you a new heart?",
        "activity": "Spend 10 minutes in silence, repeating this prayer: 'Lord, take my heart, for I cannot give it. Keep it pure for You.' Write what you felt.",
        "prayer": "Pray for someone you know whose heart has grown hard through repeated failure, that God would soften and renew them."
      },
      {
        "day": 16,
        "verse": "My sacrifice, O God, is a broken spirit; a broken and contrite heart you, God, will not despise.",
        "verseReference": "Psalm 51:17",
        "devotional": "David's greatest gift to us is his honesty. After his fall into lust and deceit, he didn't make excuses—he broke down before God. That is what repentance is: not pretending you're better than you are, but offering your brokenness to God as your worship. If you have fallen again, don't run away in shame. Run toward Him with a contrite heart. God never turns away a heart that is truly sorry and longing to be made new.",
        "reflection": "Why do you think God values a broken heart more than outward perfection?",
        "activity": "Write your own Psalm 51 today—a personal prayer admitting your weakness and asking for cleansing.",
        "prayer": "Pray for those who feel too ashamed to pray, that they may have courage to come broken before God."
      },
      {
        "day": 17,
        "verse": "Or do you show contempt for the riches of his kindness, forbearance and patience, not realizing that God's kindness is intended to lead you to repentance?",
        "verseReference": "Romans 2:4",
        "devotional": "Guilt often makes us run from God, but kindness draws us in. God doesn't manipulate you with fear; He wins you with love. When you realize that even after your relapse He still speaks to you gently, it melts your defenses. The goal isn't to feel bad—it's to be drawn close to the One who loves you. True repentance flows not from terror of punishment but from seeing Christ crucified for your sins.",
        "reflection": "Has guilt ever made you hide from God? How can His kindness draw you closer instead?",
        "activity": "Write a thank-you note to Jesus, thanking Him for His patience with you this week.",
        "prayer": "Pray for those who only know God as harsh and distant, that they may experience His kindness leading them to repentance."
      },
      {
        "day": 18,
        "verse": "Godly sorrow brings repentance that leads to salvation and leaves no regret, but worldly sorrow brings death.",
        "verseReference": "2 Corinthians 7:10",
        "devotional": "Worldly sorrow says, 'I'm ashamed I got caught.' Godly sorrow says, 'I've hurt the One who loves me most.' Porn may have left you with regret and guilt—but godly sorrow brings life and freedom. Let your grief lead you to the arms of Jesus, not into despair. His wounds are proof that even your failures can become the doorway to healing.",
        "reflection": "When you feel guilty, do you turn toward God or away from Him? Why?",
        "activity": "Think of a moment when your heart truly broke over your sin. Write what God was showing you in that moment.",
        "prayer": "Pray for someone trapped in despair over their sin, that they may find hope in God's forgiving love."
      },
      {
        "day": 19,
        "verse": "Repent, then, and turn to God, so that your sins may be wiped out, that times of refreshing may come from the Lord.",
        "verseReference": "Acts 3:19",
        "devotional": "Repentance isn't punishment—it's refreshment. Turning away from porn is not just leaving something filthy behind; it's turning toward something beautiful. God doesn't only forgive you; He wipes away your past and breathes new life into your soul. Every genuine turn toward God brings a breeze of freedom to your heart.",
        "reflection": "What does 'refreshing' feel like to you after repentance?",
        "activity": "Take a short walk today and breathe deeply. As you walk, thank God for wiping your sins away and making you new.",
        "prayer": "Pray for someone who is weary in their battle, that God's refreshing Spirit would lift their heart again."
      },
      {
        "day": 20,
        "verse": "But while he was still a long way off, his father saw him and was filled with compassion for him; he ran to his son, threw his arms around him and kissed him.",
        "verseReference": "Luke 15:20",
        "devotional": "The prodigal didn't even get to finish his confession before the Father embraced him. That's God's heart toward you. He runs toward you, even after relapse. Don't rehearse long speeches of shame—just come home. Every time you return, the Father celebrates, not scolds. Repentance is the joy of coming home again.",
        "reflection": "How does knowing the Father runs toward you change the way you approach repentance?",
        "activity": "Close your eyes and imagine the Father running toward you with open arms. Write down what you think He would say as He embraces you.",
        "prayer": "Pray for all the prodigals today—those who have wandered far—that they may hear the Father's call home."
      },
      {
        "day": 21,
        "verse": "If we confess our sins, he is faithful and just and will forgive us our sins and purify us from all unrighteousness.",
        "verseReference": "1 John 1:9",
        "devotional": "Every time you confess, forgiveness is not a maybe—it's a guarantee. God doesn't forgive reluctantly; He delights to cleanse you. Repentance is not about earning forgiveness but receiving it. When you fall, confess immediately and believe His promise. Purity is not perfection—it's walking in constant confession and cleansing.",
        "reflection": "Do you believe God actually forgives you when you confess, or do you still carry guilt? Why?",
        "activity": "Confess one hidden area you've been afraid to bring to God. Then write this: 'I am forgiven. I am cleansed.'",
        "prayer": "Pray for someone who carries secret shame, that they may experience the freedom of God's full forgiveness."
      }
    ]
  },
  "week4": {
    "title": "Confession",
    "days": [
      {
        "day": 22,
        "verse": "Whoever conceals their sins does not prosper, but the one who confesses and renounces them finds mercy.",
        "verseReference": "Proverbs 28:13",
        "devotional": "Hiding your sin keeps you in chains; confession opens the door to mercy. Many hide their addiction because they fear judgment, but silence breeds shame. The moment you agree with God about what you've done, healing begins. Mercy is waiting—not for the perfect, but for the honest. God's forgiveness flows freely where humility reigns.",
        "reflection": "What fears make you want to hide your sin instead of confessing it?",
        "activity": "Write down what you've been hiding from God. Then read it aloud in prayer, confessing honestly. Tear up or delete the note as a symbol of mercy received.",
        "prayer": "Pray for those who live in secrecy and fear, that they may find courage to bring everything to the light of Christ."
      },
      {
        "day": 23,
        "verse": "But if we walk in the light, as he is in the light, we have fellowship with one another, and the blood of Jesus, his Son, purifies us from all sin.",
        "verseReference": "1 John 1:7",
        "devotional": "Walking in the light means choosing honesty instead of hiding. Lust thrives in darkness—every secret tab, every private fantasy. But when you walk in the light, even your weakness becomes a place of grace. Jesus' blood purifies what is exposed to Him. Don't fear the light; it's where cleansing happens and true connection begins.",
        "reflection": "What part of your life still hides in darkness? What would it look like to bring it into the light with God?",
        "activity": "Share one struggle (if safe) with a trusted believer or accountability partner. If not possible yet, write a prayer of honesty to God instead.",
        "prayer": "Pray for others in secret bondage, that they may step into the healing light of truth."
      },
      {
        "day": 24,
        "verse": "Then I acknowledged my sin to you and did not cover up my iniquity. I said, 'I will confess my transgressions to the Lord.' And you forgave the guilt of my sin.",
        "verseReference": "Psalm 32:5",
        "devotional": "David describes the relief of confession—it lifted a crushing weight from his soul. Before confession, his guilt ate away at him like poison; afterward, forgiveness brought life back into his bones. Porn leaves emotional guilt that silently eats away at your peace. Confession to God is not humiliation—it's liberation. When you speak truth, the chains fall off.",
        "reflection": "What guilt or heaviness has been eating at your soul? What would it mean to finally bring it to God?",
        "activity": "Kneel in prayer. Speak aloud your confession to God as if He were sitting beside you. Imagine His face full of compassion, not anger.",
        "prayer": "Pray for someone you know who struggles to forgive themselves, that they may experience God's mercy."
      },
      {
        "day": 25,
        "verse": "Therefore confess your sins to each other and pray for each other so that you may be healed. The prayer of a righteous person is powerful and effective.",
        "verseReference": "James 5:16",
        "devotional": "Confession brings spiritual and emotional healing. God doesn't need your confession to know the truth—He invites it to set you free. When you confess to a trusted friend, mentor, or pastor, the power of secrecy breaks. Shame loses its voice in community. Healing multiplies when we stop pretending and start praying for each other.",
        "reflection": "Is there someone trustworthy you could be honest with about your struggle? What stops you from doing that?",
        "activity": "Ask God to show you one safe person you can share part of your story with this week. If already shared, send them a thank-you for walking with you.",
        "prayer": "Pray for healing in your church or community, that it becomes a place where confession is met with grace, not gossip."
      },
      {
        "day": 26,
        "verse": "Create in me a pure heart, O God, and renew a steadfast spirit within me. Do not cast me from your presence or take your Holy Spirit from me. Restore to me the joy of your salvation and grant me a willing spirit, to sustain me.",
        "verseReference": "Psalm 51:10-12",
        "devotional": "After confession comes cleansing. God doesn't just erase your past—He renews your heart and fills you with joy again. The same Spirit who convicts you of sin also restores your confidence. Don't stop at guilt; keep going until joy returns. Freedom isn't just being forgiven—it's being restored to fellowship with God.",
        "reflection": "What would it mean for you to truly feel joy in God again?",
        "activity": "Listen to a worship song about renewal (like 'Create in Me a Clean Heart' or 'Goodness of God') and journal what it stirs in you.",
        "prayer": "Pray for those who think they've sinned too much to feel joy again, that they may taste God's restoring presence."
      },
      {
        "day": 27,
        "verse": "Come now, let us settle the matter, says the Lord. Though your sins are like scarlet, they shall be as white as snow; though they are red as crimson, they shall be like wool.",
        "verseReference": "Isaiah 1:18",
        "devotional": "God doesn't avoid confronting your sin—He invites you to settle it once and for all. His cleansing is absolute. No matter how deep your impurity feels, His grace is deeper still. Confession is not reopening old wounds—it's watching them be healed. When you come to Him, the stains of lust are not covered—they are washed away entirely.",
        "reflection": "Do you believe God has really made you clean? What keeps you from accepting that truth?",
        "activity": "Wash your hands slowly while meditating on this verse. As the water runs, say aloud: 'He has made me clean.'",
        "prayer": "Pray for those tormented by guilt and memories, that they may accept the cleansing of Christ."
      },
      {
        "day": 28,
        "verse": "You will again have compassion on us; you will tread our sins underfoot and hurl all our iniquities into the depths of the sea.",
        "verseReference": "Micah 7:19",
        "devotional": "God not only forgives—He forgets. He doesn't keep your record on a shelf to remind you of failure. He buries it in the sea of His mercy. When He forgives, He destroys the evidence. Stop diving back into what He has drowned. Walk in freedom, and let gratitude replace guilt. His compassion is your new beginning.",
        "reflection": "What would your life look like if you truly believed your sins were at the bottom of the sea?",
        "activity": "Write a short note of praise to God for His compassion and forgiveness. End with the words: 'My past is gone. I am free.'",
        "prayer": "Pray for someone trapped in cycles of self-condemnation, that they may believe in God's total forgiveness."
      }
    ]
  },
  "week5": {
    "title": "Consecration",
    "days": [
      {
        "day": 29,
        "verse": "Therefore, I urge you, brothers and sisters, in view of God's mercy, to offer your bodies as a living sacrifice, holy and pleasing to God—this is your true and proper worship.",
        "verseReference": "Romans 12:1",
        "devotional": "Consecration begins with offering your body to God—not as an object of shame, but as a vessel of worship. Pornography trains you to see your body as a tool for pleasure; God calls you to see it as a temple of His Spirit. Every time you yield your desires to Him, you are performing an act of worship. Holiness is not the absence of desire, but the surrender of it to love.",
        "reflection": "What would it look like to offer your body as worship instead of as a source of guilt?",
        "activity": "Pray this aloud: 'Lord, I give You my eyes, my hands, my mind, and my heart. Make them holy instruments for Your glory.' Write it somewhere visible.",
        "prayer": "Pray for someone who feels trapped in viewing their body as dirty, that they may see themselves as God's temple."
      },
      {
        "day": 30,
        "verse": "Then he said to them all: 'Whoever wants to be my disciple must deny themselves and take up their cross daily and follow me.'",
        "verseReference": "Luke 9:23",
        "devotional": "Consecration is not a one-time act but a daily surrender. Every morning, we take up our cross—the willingness to die to self-centered pleasure. In addiction, we obey impulses; in discipleship, we submit impulses to Christ. The cross isn't about suffering for suffering's sake—it's about choosing a higher joy. Freedom begins when you stop fighting only to quit porn and start following Jesus instead.",
        "reflection": "What does taking up your cross look like in your daily habits?",
        "activity": "Before you pick up your phone today, pause and pray: 'Jesus, I take up my cross and follow You today.' Journal how that shift affects your mindset.",
        "prayer": "Pray for believers struggling with daily surrender, that they may find joy in obedience."
      },
      {
        "day": 31,
        "verse": "I have been crucified with Christ and I no longer live, but Christ lives in me. The life I now live in the body, I live by faith in the Son of God, who loved me and gave himself for me.",
        "verseReference": "Galatians 2:20",
        "devotional": "You don't overcome lust by willpower—you overcome because Jesus lives in you. Consecration means trading your strength for His life. The old you—the one enslaved to addiction—was crucified with Christ. The new you lives by His Spirit. You don't have to 'be strong'; you just have to stay surrendered. Let every temptation remind you: Christ lives in me now.",
        "reflection": "How does knowing Christ lives in you change the way you face temptation?",
        "activity": "When a lustful thought comes, speak aloud: 'That's not who I am anymore. Christ lives in me.' Note how that changes the moment.",
        "prayer": "Pray for those who still think freedom depends on their own strength, that they may learn to rest in Christ's power."
      },
      {
        "day": 32,
        "verse": "Remain in me, as I also remain in you. No branch can bear fruit by itself; it must remain in the vine. Neither can you bear fruit unless you remain in me.",
        "verseReference": "John 15:4",
        "devotional": "Consecration is connection. You cannot stay pure apart from Jesus any more than a branch can live apart from the vine. Many people try to bear fruit while disconnected—attending church, reading verses, but not abiding. To abide means to stay close, to make your home in His love. Purity flows naturally from presence.",
        "reflection": "Do you spend more time trying to fix yourself or simply staying close to Jesus?",
        "activity": "Spend 15 minutes today reading John 15 slowly. Underline or note every mention of 'remain' or 'abide.' End by writing: 'I will remain in You.'",
        "prayer": "Pray for someone whose relationship with God feels dry, that they may rediscover the joy of abiding in Christ."
      },
      {
        "day": 33,
        "verse": "For it is God who works in you to will and to act in order to fulfill his good purpose.",
        "verseReference": "Philippians 2:13",
        "devotional": "Consecration doesn't mean you do everything for God—it means you let God work everything in you. Even the desire to do right is a gift of His Spirit. Every victory over temptation is not your achievement but His grace working through you. Stop striving to earn His favor; start surrendering to His power. The more you yield, the freer you become.",
        "reflection": "When have you tried to fight lust in your own strength? How might you let God work in you instead?",
        "activity": "Write down this verse and repeat it during your toughest moment today. Notice how peace replaces panic when you remember God is working in you.",
        "prayer": "Pray for those exhausted from fighting alone, that they may experience God's strength working in them."
      },
      {
        "day": 34,
        "verse": "Those who cleanse themselves from the latter will be instruments for special purposes, made holy, useful to the Master and prepared to do any good work.",
        "verseReference": "2 Timothy 2:21",
        "devotional": "When you consecrate your life, you become useful in God's hands. He doesn't just free you from sin; He frees you for service. Your testimony, your scars, your healing—all become tools to help others. Purity isn't just about personal victory; it's about being ready for purpose. Every act of obedience sharpens you into an instrument of love.",
        "reflection": "What might God want to do through your life once you are fully yielded to Him?",
        "activity": "Ask God in prayer: 'Lord, what do You want to use my story for?' Journal any impressions or verses that come to mind.",
        "prayer": "Pray for someone who is healing from addiction, that their story may inspire others toward freedom."
      },
      {
        "day": 35,
        "verse": "Do not offer any part of yourself to sin as an instrument of wickedness, but rather offer yourselves to God as those who have been brought from death to life; and offer every part of yourself to him as an instrument of righteousness.",
        "verseReference": "Romans 6:13",
        "devotional": "Consecration is the daily choice to give yourself to God instead of sin. Every temptation is a call to surrender again. You've been raised from death to life—live like someone who belongs to heaven. When you offer your eyes, your hands, and your desires to God, you become a living testimony that grace really transforms.",
        "reflection": "What area of your life do you still need to surrender fully to God?",
        "activity": "Pray through your body, one part at a time—mind, eyes, mouth, hands, heart—offering each to God for righteousness.",
        "prayer": "Pray for all those finishing Week 5 of Novo, that their consecration would be deep, lasting, and joy-filled."
      }
    ]
  },
  "week6": {
    "title": "Faith and Acceptance",
    "days": [
      {
        "day": 36,
        "verse": "For it is by grace you have been saved, through faith—and this is not from yourselves, it is the gift of God—not by works, so that no one can boast.",
        "verseReference": "Ephesians 2:8-9",
        "devotional": "Faith begins where self-effort ends. Many people trying to break free from porn believe they must 'earn' God's acceptance through flawless performance. But grace cannot be earned—it is a gift. You don't clean yourself up to come to God; you come, and He cleanses you. When you fall, your acceptance in Christ hasn't changed. Faith means believing what God says about you even when you feel unworthy.",
        "reflection": "Do you ever feel like you need to be perfect before God will accept you? Why is that false?",
        "activity": "Write this on paper: 'I am saved by grace, not by performance.' Keep it visible today as a reminder.",
        "prayer": "Pray for someone who still feels they must earn God's love, that they may rest in His grace."
      },
      {
        "day": 37,
        "verse": "Therefore, since we have been justified through faith, we have peace with God through our Lord Jesus Christ.",
        "verseReference": "Romans 5:1",
        "devotional": "When you trust Jesus, God declares you righteous. That's what 'justified' means—set right with Him. You may still feel broken, but faith isn't about feeling—it's about trusting the finished work of Christ. Pornography creates inner chaos; faith restores peace. You are not at war with God anymore. Every time you doubt, whisper: 'I have peace with God through Jesus Christ.'",
        "reflection": "How does knowing you are already at peace with God change your view of yourself?",
        "activity": "Take 5 minutes to breathe deeply and repeat: 'I have peace with God.' Write what emotions or thoughts arise.",
        "prayer": "Pray for someone burdened with guilt, that they may feel peace through faith in Jesus."
      },
      {
        "day": 38,
        "verse": "Now faith is confidence in what we hope for and assurance about what we do not see.",
        "verseReference": "Hebrews 11:1",
        "devotional": "Faith is believing what you cannot yet see. Maybe you don't feel free yet. Maybe you still battle urges daily. Faith looks beyond what is seen to what God has promised. The more you focus on Christ instead of your failures, the stronger your faith grows. God's power is working in you, even when progress feels slow. Keep believing that freedom is already written in heaven.",
        "reflection": "What truth from Scripture can you hold on to even when you don't feel it?",
        "activity": "Choose one Bible promise about freedom (like John 8:36 or Philippians 1:6). Write it on your phone wallpaper for this week.",
        "prayer": "Pray for those losing hope in their recovery, that they may have assurance of what God is doing even if unseen."
      },
      {
        "day": 39,
        "verse": "Therefore I tell you, whatever you ask for in prayer, believe that you have received it, and it will be yours.",
        "verseReference": "Mark 11:24",
        "devotional": "Faith doesn't wait to feel something before believing. When you ask God for forgiveness or freedom, accept it immediately by faith. Say, 'God has forgiven me,' not because you feel forgiven, but because He promised it. Feelings will follow faith, not the other way around. Learn to rest in the fact that God has already begun answering your prayer.",
        "reflection": "Have you ever doubted God's forgiveness because you didn't 'feel' forgiven? How can you change that?",
        "activity": "After prayer today, write: 'Thank You, God, for hearing me.' Speak it out loud and move forward as if the prayer were already answered.",
        "prayer": "Pray for someone waiting on God's promise, that they may believe even before seeing results."
      },
      {
        "day": 40,
        "verse": "You will keep in perfect peace those whose minds are steadfast, because they trust in you.",
        "verseReference": "Isaiah 26:3",
        "devotional": "Peace doesn't come from control—it comes from trust. When your mind is focused on God instead of temptation, peace begins to rule. The enemy wants your thoughts scattered by guilt and shame. God offers steadiness. Faith means keeping your eyes on Him through every storm. When anxiety or lust creeps in, whisper His name and let peace guard your mind.",
        "reflection": "What usually robs you of peace, and how can you refocus your thoughts on God when that happens?",
        "activity": "Write this verse on a note and place it near where temptation often strikes. Let it anchor your focus.",
        "prayer": "Pray for someone who battles anxious or impure thoughts, that their mind may be kept in God's perfect peace."
      },
      {
        "day": 41,
        "verse": "For we live by faith, not by sight.",
        "verseReference": "2 Corinthians 5:7",
        "devotional": "Faith means walking forward even when you can't see the full road. Recovery may not feel linear—some days feel like progress, others like failure. But faith is a daily step in the right direction, trusting that God is working behind the scenes. Don't let yesterday's fall destroy today's faith. Keep walking; grace is the ground beneath your feet.",
        "reflection": "When have you been tempted to give up because you couldn't see progress? How can faith help you continue?",
        "activity": "Take a symbolic walk today—literally go outside and walk for 10 minutes. With each step, say, 'I walk by faith, not by sight.'",
        "prayer": "Pray for those who feel stuck in their journey, that they may keep walking in faith despite setbacks."
      },
      {
        "day": 42,
        "verse": "Being confident of this, that he who began a good work in you will carry it on to completion until the day of Christ Jesus.",
        "verseReference": "Philippians 1:6",
        "devotional": "Faith believes that God finishes what He starts. You didn't begin this journey alone, and you won't end it alone. Freedom is not about perfection but perseverance. God will complete what He has started in you—no relapse, no failure can cancel His plan. Your role is to stay surrendered, trusting that His grace is still writing your story.",
        "reflection": "What 'good work' can you see God already doing in your life right now?",
        "activity": "List 3 ways you've grown since starting Novo. Thank God for evidence of His ongoing work.",
        "prayer": "Pray for everyone in the Novo community—that each one would keep faith until God completes His work in them."
      }
    ]
  }
}