{
  "week1": {
    "title": "God's Love for You",
    "days": [
      {
        "day": 1,
        "verse": "For God so loved the world that he gave his one and only Son, that whoever believes in him shall not perish but have eternal life.",
        "verseReference": "John 3:16",
        "devotional": "God's love is not distant or abstract—it is personal. The Father gave His only Son for you. Addiction whispers that you are worthless, but the cross shouts that you are priceless. Every time you are tempted to believe shame, remember: Christ thought you were worth dying for.",
        "reflection": "God loves you even in your weakness. What does it mean to you that He gave His Son for you?",
        "activity": "Write down 3 ways you have experienced God's love in your life (big or small).",
        "prayer": "Pray for someone you know who feels unloved or unworthy, that they may see God's love."
      },
      {
        "day": 2,
        "verse": "But God demonstrates his own love for us in this: While we were still sinners, Christ died for us.",
        "verseReference": "Romans 5:8",
        "devotional": "You don't need to clean yourself up before coming to Christ. He loved you at your worst. Porn says, 'You are too dirty to be loved.' But God says, 'I loved you when you were dead in sin, and I died to bring you life.' Repentance doesn't start with your effort—it starts with God's love reaching for you in the pit.",
        "reflection": "Christ died for you at your lowest point. How does this change the way you see relapse?",
        "activity": "Journal one lie that porn has made you believe about yourself and replace it with God's truth from this verse.",
        "prayer": "Intercede for another struggler today—that they may believe they are loved even in weakness."
      },
      {
        "day": 3,
        "verse": "The eyes of all look to you, and you give them their food at the proper time. You open your hand and satisfy the desires of every living thing.",
        "verseReference": "Psalm 145:15-16",
        "devotional": "Many turn to lust when they feel empty, lonely, or restless. But God promises to open His hand and satisfy every need. The hunger for intimacy, comfort, and love that porn pretends to fill can only be truly satisfied by the living God. When you feel the urge rising, see it as a reminder to turn to Him instead of the counterfeit.",
        "reflection": "Where do you feel emptiest right now? How might God fill that place with something better than lust?",
        "activity": "When tempted today, pause and pray this Psalm aloud. Write down how it changed the moment.",
        "prayer": "Pray for those who will be tempted tonight, that God would be their strength."
      },
      {
        "day": 4,
        "verse": "See what great love the Father has lavished on us, that we should be called children of God! And that is what we are!",
        "verseReference": "1 John 3:1",
        "devotional": "Shame says: 'You are dirty, you are worthless.' God says: 'You are My child.' Your failures don't erase His fatherhood. Porn tries to steal your identity by defining you by your lust. But the truth is, your truest name is 'Beloved Child of God.' The more you believe this, the weaker lust's hold becomes.",
        "reflection": "What would it change if your deepest identity was truly 'Child of God' and not 'addict'?",
        "activity": "Write a letter to yourself as if God the Father were speaking to you. Begin with: 'My child, I love you…'.",
        "prayer": "Pray for someone younger than you who may already be trapped in lust, that they find their identity in Christ."
      },
      {
        "day": 5,
        "verse": "I have loved you with an everlasting love; I have drawn you with unfailing kindness.",
        "verseReference": "Jeremiah 31:3",
        "devotional": "God's love is everlasting. He does not stop loving you when you fall. You may hate yourself after relapse, but His love has not decreased. His kindness draws you back, not His anger. If you fall, don't hide—return to the God whose love outlasts your failures.",
        "reflection": "Think of your last relapse. How does it feel to know God's love did not end at that moment?",
        "activity": "Bring your most recent fall to God in prayer. Journal how it feels to know He still loves you.",
        "prayer": "Pray for someone who has recently fallen, that they may not give up but run back to God."
      },
      {
        "day": 6,
        "verse": "Can a mother forget the baby at her breast and have no compassion on the child she has borne? Though she may forget, I will not forget you! See, I have engraved you on the palms of my hands.",
        "verseReference": "Isaiah 49:15-16",
        "devotional": "God uses a mother's love to illustrate His own—and then says His is stronger. Even if a mother could forget her baby, He cannot forget you. Porn tells you that you are alone and unseen, but God says your name is engraved on His hands. When you see the scars on Christ's hands, remember: they testify that He cannot forget you.",
        "reflection": "What does it mean to you that your name is engraved on God's hands?",
        "activity": "Draw or write your name on your palm today as a reminder of God's promise. Reflect whenever you see it.",
        "prayer": "Intercede for someone who feels forgotten by God, that they may know they are engraved on His hands."
      },
      {
        "day": 7,
        "verse": "For I am convinced that neither death nor life, neither angels nor demons, neither the present nor the future, nor any powers, neither height nor depth, nor anything else in all creation, will be able to separate us from the love of God that is in Christ Jesus our Lord.",
        "verseReference": "Romans 8:38-39",
        "devotional": "This is the mountain peak of God's love. Nothing can separate you from Him—not relapse, not shame, not lust. Satan wants you to believe that you are beyond saving, but this verse demolishes that lie. You can fall into sin, but you cannot fall out of God's love. That truth gives you courage to rise again.",
        "reflection": "Which part of this verse speaks to you most right now? Why?",
        "activity": "Make a gratitude list of 10 things you are thankful for this week. End by writing: 'Nothing can separate me from God's love.'",
        "prayer": "Pray for the Novo community as a whole—that each struggler may believe in God's inseparable love."
      }
    ]
  },
  "week2": {
    "title": "The Sinner's Need of Christ",
    "days": [
      {
        "day": 1,
        "verse": "For all have sinned and fall short of the glory of God.",
        "verseReference": "Romans 3:23",
        "devotional": "Every person has sinned; no one is exempt. Porn addiction is just one expression of this universal brokenness. The good news is that your failure does not make you uniquely unworthy—it simply proves your need of Jesus, just like everyone else. Freedom begins when you admit that you cannot meet God's standard on your own.",
        "reflection": "How does knowing that 'all have sinned' free you from isolating shame?",
        "activity": "Write down areas of your life (not just porn) where you see evidence of sin and your need for God.",
        "prayer": "Pray for someone else you know who struggles in a visible way—that they may also see their need for Christ."
      },
      {
        "day": 2,
        "verse": "We have all become like one who is unclean, and all our righteous deeds are like a polluted garment. We all fade like a leaf, and our iniquities, like the wind, take us away.",
        "verseReference": "Isaiah 64:6",
        "devotional": "Even your best efforts cannot make you clean before God. This verse reminds us that trying harder, by itself, won't break porn's chains. Addiction teaches us to rely on willpower, but God teaches us to rely on grace. When you bring your unclean life to Him, He gives you His righteousness in exchange.",
        "reflection": "What 'self-righteous' efforts have you been relying on to fight sin? How can you bring them to God instead?",
        "activity": "Write a prayer of surrender, confessing your weakness and asking God to clothe you in Christ's righteousness.",
        "prayer": "Pray for someone who is trying to fight sin by sheer willpower, that they may discover God's grace."
      },
      {
        "day": 3,
        "verse": "The heart is deceitful above all things, and desperately sick; who can understand it?",
        "verseReference": "Jeremiah 17:9",
        "devotional": "Porn doesn't just live on screens—it thrives in a deceitful heart. We often minimize sin, excuse it, or hide it. But God sees our hearts clearly. The good news is that He not only exposes the sickness but also promises to give us a new heart. Honesty before God is the first step toward healing.",
        "reflection": "In what ways has your heart deceived you in your struggle with lust?",
        "activity": "Spend 5 minutes in silent prayer, asking God to reveal hidden motives and desires. Write down what comes to mind.",
        "prayer": "Pray for someone who is deceived by sin but does not see it yet, that God may open their eyes."
      },
      {
        "day": 4,
        "verse": "For I know that nothing good dwells in me, that is, in my flesh. For I have the desire to do what is right, but not the ability to carry it out.",
        "verseReference": "Romans 7:18",
        "devotional": "This verse captures the addict's cry: 'I want to stop, but I can't.' Even Paul felt this war in his flesh. Recognizing that you don't have the ability to carry out your desires is not defeat—it's the doorway to dependence on Christ. Your weakness creates the space for His power.",
        "reflection": "How does admitting your inability to change on your own make room for God's strength?",
        "activity": "Journal a time when you sincerely wanted to quit but fell anyway. Then write: 'Lord, I cannot, but You can.'",
        "prayer": "Pray for someone in recovery who feels hopeless because of repeated failure."
      },
      {
        "day": 5,
        "verse": "I am the vine; you are the branches. Whoever abides in me and I in him, he it is that bears much fruit, for apart from me you can do nothing.",
        "verseReference": "John 15:5",
        "devotional": "Victory is not found in trying harder but in abiding deeper. A branch disconnected from the vine cannot bear fruit. In the same way, you cannot bear purity apart from Christ. The call is simple: remain in Him daily. The more connected you are to Him, the more His life flows into you.",
        "reflection": "What does it mean to you, practically, to 'abide' in Christ this week?",
        "activity": "Spend 10 minutes reading John 15:1–11 slowly. Write down 3 ways you can stay connected to Christ today.",
        "prayer": "Pray for another struggler to experience the life of Christ flowing into their weakest places."
      },
      {
        "day": 6,
        "verse": "For the wages of sin is death, but the free gift of God is eternal life in Christ Jesus our Lord.",
        "verseReference": "Romans 6:23",
        "devotional": "Sin always pays its wage: death. Porn kills intimacy, kills joy, kills hope. But God offers a better gift—eternal life in Christ. You don't have to stay stuck in the paycheck of death. Eternal life begins now, in freedom through Jesus.",
        "reflection": "How have you experienced 'death' in your life as a result of lust? How does this verse offer you hope?",
        "activity": "List 3 ways porn has 'paid death' in your life, then next to each one write what God promises instead in Christ.",
        "prayer": "Pray for someone who is still enslaved to porn, that they may discover the gift of life in Jesus."
      },
      {
        "day": 7,
        "verse": "For if, because of one man's trespass, death reigned through that one man, much more will those who receive the abundance of grace and the free gift of righteousness reign in life through the one man Jesus Christ.",
        "verseReference": "Romans 5:17",
        "devotional": "Adam's fall brought death, but Christ's gift brings life and victory. Grace is not just forgiveness—it is power to reign in life. Addiction makes you feel powerless, but Christ gives you authority to stand. The reign of sin can be broken by the reign of grace.",
        "reflection": "Where in your life do you feel 'reigned over' by sin? How could grace reign there instead?",
        "activity": "Write down one area of life where you feel powerless. Pray specifically for God's grace to reign in that area this week.",
        "prayer": "Pray for the Novo community—that God's grace would reign over every place of bondage."
      }
    ]
  }
}